In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.3.3-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.5 MB)
     |████████████████████████████████| 11.5 MB 15 kB/s
Collecting pytz>=2017.3
  Downloading pytz-2021.3-py2.py3-none-any.whl (503 kB)
     |████████████████████████████████| 503 kB 337 kB/s
Requirement already satisfied: python-dateutil>=2.7.3 in /home/avigupta/Projects/OpenGenus-Notebook/opengenus/lib/python3.8/site-packages (from pandas) (2.8.2)
Collecting numpy>=1.17.3
  Downloading numpy-1.21.2-cp38-cp38-manylinux_2_12_x86_64.manylinux2010_x86_64.whl (15.8 MB)
     |████████████████████████████████| 15.8 MB 38 kB/s
Requirement already satisfied: six>=1.5 in /home/avigupta/Projects/OpenGenus-Notebook/opengenus/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.21.2 pandas-1.3.3 pytz-2021.3
WARNING: You are using pip version 21.0.1; however, version 21.2.4 is available.
You should consider upgrading via the '/home/avigupta/Projects/OpenGenus-Notebook/opengenus/bin/python -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [4]:
my_series = pd.Series([5, 6, 7, 8, 9, 10])

my_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [6]:
print(my_series.index)
my_series.values

RangeIndex(start=0, stop=6, step=1)

array([ 5,  6,  7,  8,  9, 10])

In [7]:
my_series[4]

9

In [8]:
my_series3 = pd.Series({'a': 5, 'b': 6, 'c': 7, 'd': 8})
my_series3

a    5
b    6
c    7
d    8
dtype: int64

In [81]:
df = pd.read_csv('olympic_data.csv', sep = "\t")
df

,Michael Phelps,23,United States,2008,08-24-08,Swimming,8,0,0.1,8.1
0,Michael Phelps,19.0,United States,2004,08-29-04,Swimming,6,0,2,8
1,Michael Phelps,27.0,United States,2012,08-12-12,Swimming,4,2,0,6
2,Natalie Coughlin,25.0,United States,2008,08-24-08,Swimming,1,2,3,6
3,Aleksey Nemov,24.0,Russia,2000,10-01-00,Gymnastics,2,1,3,6
4,Alicia Coutts,24.0,Australia,2012,08-12-12,Swimming,1,3,1,5
...,...,...,...,...,...,...,...,...,...,...
8612,Olena Sadovnycha,32.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8613,Kateryna Serdiuk,17.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8614,Wietse van Alten,21.0,Netherlands,2000,10-01-00,Archery,0,0,1,1
8615,Sandra Wagner-Sachse,31.0,Germany,2000,10-01-00,Archery,0,0,1,1
8616,Rod White,23.0,United States,2000,10-01-00,Archery,0,0,1,1

In [34]:
df = pd.DataFrame({'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],'population': [17.04, 143.5, 9.5, 45.5],'square': [2724902, 17125191, 207600, 603628]})
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [32]:
import json
fruits={'Fruits':['Apple','Banana','Orange'],'in_stock':['yes','yes','no'],'Price':[10,7,5]}
json_object=json.dumps(fruits,indent=4)
df = pd.read_json(json_object)
df

   Fruits in_stock  Price
0   Apple      yes     10
1  Banana      yes      7
2  Orange       no      5

In [39]:
df = pd.read_csv('olympic_data.csv', sep = "\t")
df.head()

,Michael Phelps,23,United States,2008,08-24-08,Swimming,8,0,0.1,8.1
0,Michael Phelps,19.0,United States,2004,08-29-04,Swimming,6,0,2,8
1,Michael Phelps,27.0,United States,2012,08-12-12,Swimming,4,2,0,6
2,Natalie Coughlin,25.0,United States,2008,08-24-08,Swimming,1,2,3,6
3,Aleksey Nemov,24.0,Russia,2000,10-01-00,Gymnastics,2,1,3,6
4,Alicia Coutts,24.0,Australia,2012,08-12-12,Swimming,1,3,1,5

In [40]:
df.tail()

,Michael Phelps,23,United States,2008,08-24-08,Swimming,8,0,0.1,8.1
8612,Olena Sadovnycha,32.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8613,Kateryna Serdiuk,17.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8614,Wietse van Alten,21.0,Netherlands,2000,10-01-00,Archery,0,0,1,1
8615,Sandra Wagner-Sachse,31.0,Germany,2000,10-01-00,Archery,0,0,1,1
8616,Rod White,23.0,United States,2000,10-01-00,Archery,0,0,1,1

In [48]:
print(df.shape)
df.info()

(8617, 10)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8617 entries, 0 to 8616
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Michael Phelps  8612 non-null   object
 1   23              8612 non-null   float64
 2   United States   8617 non-null   object
 3   2008            8617 non-null   int64
 4   08-24-08        8617 non-null   object
 5   Swimming        8617 non-null   object
 6   8               8617 non-null   int64
 7   0               8617 non-null   int64
 8   0.1             8617 non-null   int64
 9   8.1             8617 non-null   int64
dtypes: float64(1), int64(5), object(4)
memory usage: 673.3+ KB

In [55]:
print(df.dtypes)
df.to_numpy()

Michael Phelps     object
23                float64
United States      object
2008                int64
08-24-08           object
Swimming           object
8                   int64
0                   int64
0.1                 int64
8.1                 int64
dtype: object

array([['Michael Phelps', 19.0, 'United States', ..., 0, 2, 8],
       ['Michael Phelps', 27.0, 'United States', ..., 2, 0, 6],
       ['Natalie Coughlin', 25.0, 'United States', ..., 2, 3, 6],
       ...,
       ['Wietse van Alten', 21.0, 'Netherlands', ..., 0, 1, 1],
       ['Sandra Wagner-Sachse', 31.0, 'Germany', ..., 0, 1, 1],
       ['Rod White', 23.0, 'United States', ..., 0, 1, 1]], dtype=object)

In [58]:
print(df.columns)
df.describe()

Index(['Michael Phelps', '23', 'United States', '2008', '08-24-08', 'Swimming',
       '8', '0', '0.1', '8.1'],
      dtype='object')

,23,2008,8,0,0.1,8.1
count,8612.000000,8617.000000,8617.000000,8617.000000,8617.000000,8617.000000
mean,26.405829,2005.978647,0.363816,0.363352,0.377742,1.104909
std,5.102282,4.290140,0.539141,0.511627,0.505018,0.402113
min,15.000000,2000.000000,0.000000,0.000000,0.000000,1.000000
25%,23.000000,2002.000000,0.000000,0.000000,0.000000,1.000000
50%,26.000000,2006.000000,0.000000,0.000000,0.000000,1.000000
75%,29.000000,2010.000000,1.000000,1.000000,1.000000,1.000000
max,61.000000,2012.000000,6.000000,3.000000,3.000000,8.000000

In [61]:
df.describe(include='all')

,Michael Phelps,23,United States,2008,08-24-08,Swimming,8,0,0.1,8.1
count,8612,8612.000000,8617,8617.000000,8617,8617,8617.000000,8617.000000,8617.000000,8617.000000
unique,6955,NaN,110,NaN,7,49,NaN,NaN,NaN,NaN
top,Matt Wells,NaN,United States,NaN,08-24-08,Athletics,NaN,NaN,NaN,NaN
freq,4,NaN,1108,NaN,1871,687,NaN,NaN,NaN,NaN
mean,NaN,26.405829,NaN,2005.978647,NaN,NaN,0.363816,0.363352,0.377742,1.104909
std,NaN,5.102282,NaN,4.290140,NaN,NaN,0.539141,0.511627,0.505018,0.402113
min,NaN,15.000000,NaN,2000.000000,NaN,NaN,0.000000,0.000000,0.000000,1.000000
25%,NaN,23.000000,NaN,2002.000000,NaN,NaN,0.000000,0.000000,0.000000,1.000000
50%,NaN,26.000000,NaN,2006.000000,NaN,NaN,0.000000,0.000000,0.000000,1.000000
75%,NaN,29.000000,NaN,2010.000000,NaN,NaN,1.000000,1.000000,1.000000,1.000000
max,NaN,61.000000,NaN,2012.000000,NaN,NaN,6.000000,3.000000,3.000000,8.000000

In [65]:
df.reset_index()

,index,Michael Phelps,23,United States,2008,08-24-08,Swimming,8,0,0.1,8.1
0,0,Michael Phelps,19.0,United States,2004,08-29-04,Swimming,6,0,2,8
1,1,Michael Phelps,27.0,United States,2012,08-12-12,Swimming,4,2,0,6
2,2,Natalie Coughlin,25.0,United States,2008,08-24-08,Swimming,1,2,3,6
3,3,Aleksey Nemov,24.0,Russia,2000,10-01-00,Gymnastics,2,1,3,6
4,4,Alicia Coutts,24.0,Australia,2012,08-12-12,Swimming,1,3,1,5
...,...,...,...,...,...,...,...,...,...,...,...
8612,8612,Olena Sadovnycha,32.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8613,8613,Kateryna Serdiuk,17.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8614,8614,Wietse van Alten,21.0,Netherlands,2000,10-01-00,Archery,0,0,1,1
8615,8615,Sandra Wagner-Sachse,31.0,Germany,2000,10-01-00,Archery,0,0,1,1
8616,8616,Rod White,23.0,United States,2000,10-01-00,Archery,0,0,1,1

In [76]:
print(df.isnull().sum())

Michael Phelps    5
23                5
United States     0
2008              0
08-24-08          0
Swimming          0
8                 0
0                 0
0.1               0
8.1               0
dtype: int64

In [77]:
print(df['23'].isnull().sum())
print(df[df['23'].isnull()])

5
     Michael Phelps  23 United States  2008  08-24-08    Swimming  8  0  0.1  \
1427            NaN NaN        Brazil  2012  08-12-12  Volleyball  0  1    0
1428            NaN NaN        Brazil  2012  08-12-12  Volleyball  0  1    0
1429            NaN NaN        Brazil  2012  08-12-12  Volleyball  0  1    0
4484            NaN NaN     Argentina  2012  08-12-12      Hockey  0  1    0
4485            NaN NaN     Argentina  2012  08-12-12      Hockey  0  1    0

      8.1
1427    1
1428    1
1429    1
4484    1
4485    1

In [82]:
df['23']=df['23'].fillna(df['23'].mean())
df[df['23'].isnull()]

Empty DataFrame
Columns: [Michael Phelps, 23, United States, 2008, 08-24-08, Swimming, 8, 0, 0.1, 8.1]
Index: []

In [83]:
df.dropna()

,Michael Phelps,23,United States,2008,08-24-08,Swimming,8,0,0.1,8.1
0,Michael Phelps,19.0,United States,2004,08-29-04,Swimming,6,0,2,8
1,Michael Phelps,27.0,United States,2012,08-12-12,Swimming,4,2,0,6
2,Natalie Coughlin,25.0,United States,2008,08-24-08,Swimming,1,2,3,6
3,Aleksey Nemov,24.0,Russia,2000,10-01-00,Gymnastics,2,1,3,6
4,Alicia Coutts,24.0,Australia,2012,08-12-12,Swimming,1,3,1,5
...,...,...,...,...,...,...,...,...,...,...
8612,Olena Sadovnycha,32.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8613,Kateryna Serdiuk,17.0,Ukraine,2000,10-01-00,Archery,0,1,0,1
8614,Wietse van Alten,21.0,Netherlands,2000,10-01-00,Archery,0,0,1,1
8615,Sandra Wagner-Sachse,31.0,Germany,2000,10-01-00,Archery,0,0,1,1
8616,Rod White,23.0,United States,2000,10-01-00,Archery,0,0,1,1